// 갑,을 - 청색, 병,정 - 적색, 무,기 - 황색, 경,신 - 백색, 임,계 - 흑색
let gan = "갑|甲|청|靑,을|乙|청|靑,병|丙|적|赤,정|丁|적|赤,무|戊|황|黃,기|己|황|黃,경|庚|백|白,신|辛|백|白,임|壬|흑|黑,계|癸|흑|黑".split(",");
console.log(gan.length, " :", gan);
let ji = "자|子|쥐|서(鼠),축|丑|소|우(牛),인|寅|호랑이|호(虎),묘|卯|토끼|토(兔 또는 兎),진|辰|용|용(龍 또는 龙),사|巳|뱀|사(蛇),오|午|말|마(馬 또는 马),미|未|양|양(羊),신|申|원숭이|후(猴),유|酉|닭|계(雞 또는 鸡),술|戌|개|구(狗) 또는 견(犬),해|亥|돼지|저(豬 또는 猪)".split(",");
console.log(ji.length, " :", ji);
// 년도 계산
year = new Date().getFullYear();
console.log("현재 년도 :", year);
for(let i=year-50;i<=year+50;i++){
    let yy = i-4;
    console.log(i + "년은 '", 
                gan[yy%10].split("|")[0] + ji[yy%12].split("|")[0], "(", 
                gan[yy%10].split("|")[1] + ji[yy%12].split("|")[1],",",
                gan[yy%10].split("|")[2] + ji[yy%12].split("|")[2],"띠)'년입니다." );
}